app/controllers/teachings_controller.rb

  def index
    @teachings = Teaching.find(:all)
    @graduate_courses = GraduateCourse.find(:all, :include => :curriculums)
    @graduate_courses.each do |g|
      g['teachings'] = []
      g.curriculums.each do |c|
---
SELECT * FROM `teachings`