app/controllers/teachers_controller.rb

SELECT * FROM `users` WHERE (`users`.`specified_type` = 'Teacher') LIMIT 1
---
  def index
    @teachers = User.find_by_specified_type("Teacher")

SELECT * FROM `teachers` WHERE (`teachers`.`id` = '--- !ruby/object:FlexMock::ExpectationRecorder \nexpectations: \n- - :should_receive\n - - :id\n -\n- - :once\n - []\n\n -\n- - :and_return\n - - :an_id\n -\n- - :should_receive\n - - :name\n -\n- - :once\n - []\n\n -\n- - :and_return\n - - :a_name\n -\n- - :should_receive\n - - :surname\n -\n- - :once\n - []\n\n -\n- - :and_return\n - - :a_surname\n -\n- - :should_receive\n - - :teachings\n -\n- - :and_return\n - - !ruby/object:FlexMock::ExpectationRecorder \n expectations: \n - - :should_receive\n - - :name\n -\n -\n')
---
  def show
    @teacher = Teacher.find(params[:id])

INSERT INTO `teachers` (`name`, `surname`, `created_at`, `updated_at`) VALUES(NULL, NULL, '2009-03-01 15:51:21', '2009-03-01 15:51:21')
INSERT INTO `addresses` (`city`, `telephone`, `street`, `created_at`, `updated_at`) VALUES(NULL, NULL, NULL, '2009-03-01 15:51:21', '2009-03-01 15:51:21')
SELECT * FROM `graduate_courses` WHERE (`graduate_courses`.`id` = '--- :another_id\n')
---
  def create
    user = User.find_by_mail(params[:mail])
    if user == nil
      @teacher = User.new()
      @teacher.mail = params[:mail]
      @teacher.random = rand(120)
      t = Teacher.new()
      a = Address.new()
      t.save
      a.save false
      @teacher.specified = t
      @teacher.address = a
      if @teacher.save
        @teacher.graduate_courses << GraduateCourse.find(params[:graduate_course_id])