app/controllers/timetables_controller.rb

SELECT * FROM `timetables`
---
  def index
    @graduate_courses = GraduateCourse.find(:all, :include => :timetables, :order => "name ASC")
    @timetables = Hash.new
    @graduate_courses.each do |g|